Autodesk.Revit.UI.DockablePaneState.SetFloatingRectangle(Autodesk.Revit.DB.Rectangle)
When %dockPosition% is Floating, sets the rectangle used to determine the size and position of the pane when %dockPosition% is Floating.  Coordinates are relative to the upper-left-hand corner of the main Revit window.
rect:
The rectangle to use when floating.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Rectangle is not normalized.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.UI.DockablePaneState.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.UI.DockablePaneState.MinimumHeight
When %dockPosition% is anything other than floating, the minimum height to use for the pane. Default is 200 pixels.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for minimumHeight is not positive.
Since:
2020

Autodesk.Revit.UI.DockablePaneState.MinimumWidth
When %dockPosition% is anything other than floating, the minimum width to use for the pane. Default is 200 pixels.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for minimumWidth is not positive.
Since:
2020

Autodesk.Revit.UI.DockablePaneState.TabBehind
Ignored unless %dockPosition% is Tabbed.  The new pane will appear in a tab behind the specified existing pane ID.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: no dockable pane has been registered with identifier tabBehind.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2014

Autodesk.Revit.UI.DockablePaneState.FloatingRectangle
When %dockPosition% is Floating, this rectangle determines the size and position of the pane.  Coordinates are relative to the upper-left-hand corner of the main Revit window.
Note: the returned Rectangle is a copy. In order to change the pane state, you must call SetFloatingRectangle with a modified rectangle.
Since:
2014

Autodesk.Revit.UI.DockablePaneState.DockPosition
Which part of the Revit application frame the pane should dock to.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.UI.DockablePaneState.#ctor(Autodesk.Revit.UI.DockablePaneState)
Constructs a new copy of the input DockablePaneState object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.UI.DockablePaneState.#ctor
Creates a new DockablePaneState object.
Since:
2014

Autodesk.Revit.UI.DockablePaneState
Describes where a dockable pane window should appear in the Revit user interface.
Since:
2014